tutorials/combustion/reactingFoam/ras/counterFlowFlame2D/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

psiChemistryModel  ODEChemistryModel<gasThermoPhysics>;

chemistry           on;

chemistrySolver     ode;

initialChemicalTimeStep 1e-07;

turbulentReaction   on;

sequentialCoeffs
{
    cTauChem        0.001;
}

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    ODESolver       SIBS;
    eps             0.05;
    scale           1;
}

Cmix            Cmix [ 0 0 0 0 0 0 0 ] 0.1;

// ************************************************************************* //
